connect to database

In [1]:
import sqlite3
db=sqlite3.connect('lol.sqlite')

create cursor

In [2]:
cursor=db.cursor()

now write mysql query and store that into some variable and then execute it using cursor

In [3]:
ct='create table emp(eid int primary key not null,ename varchar(100),salary int)'
cursor.execute(ct)

now we can insert the data into the database

In [4]:
push='insert into emp values (1,"adi",1),(2,"adi",2),(3,"adi",3),(4,"adi",4),(5,"adi",5),(6,"adi",6),(7,"adi",7)'
cursor.execute(push)

now we need to commit in order to make changes into the database

In [5]:
db.commit()

if we have data that is stored in form of variables then we can also insert them in the table

In [8]:
a=8
b="Maheshwari"
c=100000
cursor.execute('insert into emp values (?,?,?)',(a,b,c))
db.commit()

if we want to insert multiple values into the database at once then we need to pass the array of values

In [9]:
arr=[(9,"plot",7400),(10,"desc",7500),(11,"gfg",7600)]
cursor.executemany('insert into emp values (?,?,?)',arr)

In [10]:
db.commit()

lets update some values into the table

In [14]:
cursor.execute('update emp set salary=100')
db.commit()

In [17]:
cursor.execute('update emp set salary=? where eid=10',(852))

ProgrammingError: parameters are of unsupported type

here it will throw error because we haven't passed tuple properly the below representation of tuple is correct

In [16]:
cursor.execute('update emp set salary=? where eid=4',(758,))
db.commit()

if we want to fetch the data from any table

In [23]:
cursor.execute('select * from emp')
print(cursor.fetchone())
print(cursor.fetchmany(8))
print(cursor.fetchall())

(1, 'adi', 100)
[(2, 'adi', 100), (3, 'adi', 100), (4, 'adi', 758), (5, 'adi', 100), (6, 'adi', 100), (7, 'adi', 100), (8, 'Maheshwari', 100), (9, 'plot', 100)]
[(10, 'desc', 100), (11, 'gfg', 100)]

One of the best way to work with sql along with python is by using pandas

In [25]:
import pandas as pd
conn=sqlite3.connect('loda.sqlite')
data=pd.read_sql_query('select * from emp',conn)
data

    eid       ename  salary
0     1         adi     100
1     2         adi     100
2     3         adi     100
3     4         adi     758
4     5         adi     100
5     6         adi     100
6     7         adi     100
7     8  Maheshwari     100
8     9        plot     100
9    10        desc     100
10   11         gfg     100

and now we can make changes into the table very easily

if we want to create table then

In [29]:
arr=[[1,"aditya",100],[2,"aditya",200],[3,"aditya",300],[4,"aditya",400]]
column=['id','name','salary']
da=pd.DataFrame(arr,columns=column)
#to sql take two argumnets 1st is table name and 2nd is the name of database
da.to_sql('corpurate',db)

4

if we want to add new column into the database then

In [31]:
da['sex']="male"
da.to_sql('corpurate',db,if_exists='replace')

4